## Plan Result (sbox_landing)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 234 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;01&#34;].azurerm_resource_group.this[&#34;logic&#34;]
* Update
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mssql.azurerm_mssql_server.this
* Delete
  * azurerm_container_group.runner[&#34;00dlrm-ingestionengine&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-external-storage-sbox-User-dominic.leary@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-external-storage-sbox-User-prasanna.krishnan@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-logging-sbox-User-dominic.leary@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-logging-sbox-User-prasanna.krishnan@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-management-sbox-User-dominic.leary@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-management-sbox-User-prasanna.krishnan@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-metadata-sbox-User-dominic.leary@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-metadata-sbox-User-prasanna.krishnan@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-network-sbox-User-dominic.leary@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-network-sbox-User-prasanna.krishnan@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-runtimes-sbox-User-dominic.leary@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-runtimes-sbox-User-prasanna.krishnan@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-shared-integration-sbox-User-dominic.leary@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-shared-integration-sbox-User-prasanna.krishnan@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-shared-product-sbox-User-dominic.leary@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-shared-product-sbox-User-prasanna.krishnan@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-storage-sbox-User-dominic.leary@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-storage-sbox-User-prasanna.krishnan@justice.gov.uk&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_data_factory_integration_runtime_self_hosted.this
  * module.data_landing_zone[&#34;00&#34;].azurerm_eventhub_namespace.this
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.legacy_database_password[&#34;legacy-sql&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.legacy_database_username[&#34;legacy-sql&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.log_analytics_workspace_id
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.log_analytics_workspace_secret
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.mssql_password
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.mssql_username
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.mysql_connection_string
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.mysql_password
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.mysql_username
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.synapse_sql_password
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.synapse_sql_username
  * module.data_landing_zone[&#34;00&#34;].azurerm_log_analytics_workspace.this
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.adf.azure.com&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.blob.core.windows.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.datafactory.azure.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.dev.azuresynapse.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.dfs.core.windows.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.mysql.database.azure.com&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.servicebus.windows.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.sql.azuresynapse.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.vaultcore.azure.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;external-storage&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;logging&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;management&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;metadata&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;network&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;runtimes&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;shared-integration&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;shared-product&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;storage&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.datafactory_databricks
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.datafactory_storage[&#34;curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.datafactory_storage[&#34;raw&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;external&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;raw&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_management_policy.this[&#34;curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_management_policy.this[&#34;external&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_management_policy.this[&#34;raw&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_management_policy.this[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_synapse_workspace.this
  * module.data_landing_zone[&#34;00&#34;].random_password.legacy_database_password[&#34;legacy-sql&#34;]
  * module.data_landing_zone[&#34;00&#34;].random_password.synapse_sql_password
  * module.data_landing_zone[&#34;00&#34;].random_string.legacy_database_username[&#34;legacy-sql&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault.azurerm_key_vault.kv
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault.azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;ingest00-metadata-db-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_private_endpoint.metadata_mssql_pe[0]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.random_password.mssql_password[0]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mysql.azurerm_mysql_flexible_database.this[&#34;ingest00-HiveMetastoreDb-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mysql.azurerm_mysql_flexible_server.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mysql.random_password.mysql_password[0]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault_pe[&#34;meta001&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault_pe[&#34;meta002&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_group.this[&#34;nsg&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.deny_inbound[&#34;nsg&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Allow_SDS_PTL_ADO_Agents&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-eventhub&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-sql&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-storage&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-webapp&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-worker-inbound&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-worker-outbound&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_route.this[&#34;rt-default&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_route_table.this[&#34;rt&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-integration-001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-integration-002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-product-001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-product-002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-gh-runners&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-services&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-services-mysql&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-integration-001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-integration-002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-product-001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-product-002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-gh-runners&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-services&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-services-mysql&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-integration-001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-integration-002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-product-001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-product-002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-gh-runners&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-services&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-services-mysql&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_virtual_network.this[&#34;vnet&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest00curatedsbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest00rawsbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this[&#34;ingest00-integration-databricks001-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_sql_database.this[&#34;ingest00-metadata-db-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest00-meta001-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_sql_server.this[&#34;ingest00-metadata-mssql-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;storage-curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;storage-raw&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;purview&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;storage-curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;storage-raw&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_eventhub_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_product_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_key_vault_secret.shir_password
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_lb.shir_lb
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_lb_backend_address_pool.shir
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_lb_nat_pool.shir
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_lb_probe.shir
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_lb_rule.shir
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_virtual_machine_scale_set_extension.shir_install
  * module.data_landing_zone[&#34;00&#34;].module.shir001.random_password.shir_password
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;di001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;di002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;di001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;di002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;dp001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;dp002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;curated-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;curated-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;external-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;external-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;raw-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;raw-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;workspace-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;workspace-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;dev&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;sql&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;sqlOnDemand&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.vnet_peer_hub.azurerm_virtual_network_peering.initiator_to_target
  * module.data_landing_zone[&#34;00&#34;].module.vnet_peer_hub.azurerm_virtual_network_peering.target_to_initiator
  * module.data_landing_zone[&#34;00&#34;].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0]
  * module.data_landing_zone[&#34;00&#34;].module.shir001.module.shir_vmss.random_string.password




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_container_group.runner["00dlrm-ingestionengine"] will be destroyed
  # (because key ["00dlrm-ingestionengine"] is not in for_each map)
  - resource "azurerm_container_group" "runner" {
      - dns_name_label_reuse_policy = "Unsecure" -> null
      - exposed_port                = [
          - {
              - port     = 8080
              - protocol = "TCP"
            },
        ] -> null
      - id                          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-management-sbox/providers/Microsoft.ContainerInstance/containerGroups/ingest00-runner-sbox" -> null
      - ip_address                  = "10.247.4.196" -> null
      - ip_address_type             = "Private" -> null
      - location                    = "uksouth" -> null
      - name                        = "ingest00-runner-sbox" -> null
      - os_type                     = "Linux" -> null
      - resource_group_name         = "ingest00-management-sbox" -> null
      - restart_policy              = "Always" -> null
      - sku                         = "Standard" -> null
      - subnet_ids                  = [
          - "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-gh-runners-sbox",
        ] -> null
      - tags                        = {
          - "Data-Ingest-Project" = "example landing zone"
          - "application"         = "dlrm-data-ingest"
          - "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          - "businessArea"        = "cross-cutting"
          - "criticality"         = "Low"
          - "environment"         = "sandbox"
          - "expiresAfter"        = "3000-01-01"
          - "startupMode"         = "always"
        } -> null
      - zones                       = [] -> null

      - container {
          - commands                     = [] -> null
          - cpu                          = 0.5 -> null
          - cpu_limit                    = 0 -> null
          - environment_variables        = {
              - "GH_OWNER"      = "hmcts"
              - "GH_REPOSITORY" = "dlrm-ingestionengine"
              - "GH_TOKEN"      = (sensitive value)
            } -> null
          - image                        = "hmctspublic.azurecr.io/github-runner:prod-84d74135-1707147900" -> null
          - memory                       = 1.5 -> null
          - memory_limit                 = 0 -> null
          - name                         = "runner" -> null
          - secure_environment_variables = (sensitive value) -> null

          - ports {
              - port     = 8080 -> null
              - protocol = "TCP" -> null
            }
        }
    }

  # azurerm_role_assignment.roles["00-ingest00-external-storage-sbox-User-dominic.leary@justice.gov.uk"] will be destroyed
  # (because key ["00-ingest00-external-storage-sbox-User-dominic.leary@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-external-storage-sbox/providers/Microsoft.Authorization/roleAssignments/5d3c263c-6d3b-f79a-e04b-bd45f159305f" -> null
      - name                 = "5d3c263c-6d3b-f79a-e04b-bd45f159305f" -> null
      - principal_id         = "8c3e64ea-b92f-4e47-b6d9-7abbb1df48e3" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name = "Owner" -> null
      - scope                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-external-storage-sbox" -> null
    }

  # azurerm_role_assignment.roles["00-ingest00-external-storage-sbox-User-prasanna.krishnan@justice.gov.uk"] will be destroyed
  # (because key ["00-ingest00-external-storage-sbox-User-prasanna.krishnan@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-external-storage-sbox/providers/Microsoft.Authorization/roleAssignments/f27e7a61-c264-c11d-94b8-8f38ec36b6ca" -> null
      - name                 = "f27e7a61-c264-c11d-94b8-8f38ec36b6ca" -> null
      - principal_id         = "c064d48d-defc-4a2f-afba-5c8571d44de4" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name = "Owner" -> null
      - scope                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-external-storage-sbox" -> null
    }

  # azurerm_role_assignment.roles["00-ingest00-logging-sbox-User-dominic.leary@justice.gov.uk"] will be destroyed
  # (because key ["00-ingest00-logging-sbox-User-dominic.leary@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logging-sbox/providers/Microsoft.Authorization/roleAssignments/499005d2-e9f1-16ed-c82b-c102e1db694e" -> null
      - name                 = "499005d2-e9f1-16ed-c82b-c102e1db694e" -> null
      - principal_id         = "8c3e64ea-b92f-4e47-b6d9-7abbb1df48e3" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name = "Owner" -> null
      - scope                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logging-sbox" -> null
    }

  # azurerm_role_assignment.roles["00-ingest00-logging-sbox-User-prasanna.krishnan@justice.gov.uk"] will be destroyed
  # (because key ["00-ingest00-logging-sbox-User-prasanna.krishnan@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logging-sbox/providers/Microsoft.Authorization/roleAssignments/33b1a4e5-9c1c-d090-528f-5f2ef91c865f" -> null
      - name                 = "33b1a4e5-9c1c-d090-528f-5f2ef91c865f" -> null
      - principal_id         = "c064d48d-defc-4a2f-afba-5c8571d44de4" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name = "Owner" -> null
      - scope                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logging-sbox" -> null
    }

  # azurerm_role_assignment.roles["00-ingest00-management-sbox-User-dominic.leary@justice.gov.uk"] will be destroyed
  # (because key ["00-ingest00-management-sbox-User-dominic.leary@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-management-sbox/providers/Microsoft.Authorization/roleAssignments/ab1ea86d-4d22-722a-2770-7bdb599befa0" -> null
      - name                 = "ab1ea86d-4d22-722a-2770-7bdb599befa0" -> null
      - principal_id         = "8c3e64ea-b92f-4e47-b6d9-7abbb1df48e3" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name = "Owner" -> null
      - scope                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-management-sbox" -> null
    }

  # azurerm_role_assignment.roles["00-ingest00-management-sbox-User-prasanna.krishnan@justice.gov.uk"] will be destroyed
  # (because key ["00-ingest00-management-sbox-User-prasanna.krishnan@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-management-sbox/providers/Microsoft.Authorization/roleAssignments/9bc48ec2-0167-bf45-a1f7-480f6e9b80fc" -> null
      - name                 = "9bc48ec2-0167-bf45-a1f7-480f6e9b80fc" -> null
      - principal_id         = "c064d48d-defc-4a2f-afba-5c8571d44de4" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name = "Owner" -> null
      - scope                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-management-sbox" -> null
    }

  # azurerm_role_assignment.roles["00-ingest00-metadata-sbox-User-dominic.leary@justice.gov.uk"] will be destroyed
  # (because key ["00-ingest00-metadata-sbox-User-dominic.leary@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-metadata-sbox/providers/Microsoft.Authorization/roleAssignments/d99f80a9-61c6-81b8-c42d-6fd5e401a594" -> null
      - name                 = "d99f80a9-61c6-81b8-c42d-6fd5e401a594" -> null
      - principal_id         = "8c3e64ea-b92f-4e47-b6d9-7abbb1df48e3" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name = "Owner" -> null
      - scope                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-metadata-sbox" -> null
    }

  # azurerm_role_assignment.roles["00-ingest00-metadata-sbox-User-prasanna.krishnan@justice.gov.uk"] will be destroyed
  # (because key ["00-ingest00-metadata-sbox-User-prasanna.krishnan@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-metadata-sbox/providers/Microsoft.Authorization/roleAssignments/1f0fbb3f-1760-55d3-dc80-69539377115e" -> null
      - name                 = "1f0fbb3f-1760-55d3-dc80-69539377115e" -> null
      - principal_id         = "c064d48d-defc-4a2f-afba-5c8571d44de4" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name = "Owner" -> null
      - scope                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-metadata-sbox" -> null
    }

  # azurerm_role_assignment.roles["00-ingest00-network-sbox-User-dominic.leary@justice.gov.uk"] will be destroyed
  # (because key ["00-ingest00-network-sbox-User-dominic.leary@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Authorization/roleAssignments/d51f0d53-834d-cfdf-351d-4ad13213f541" -> null
      - name                 = "d51f0d53-834d-cfdf-351d-4ad13213f541" -> null
      - principal_id         = "8c3e64ea-b92f-4e47-b6d9-7abbb1df48e3" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name = "Owner" -> null
      - scope                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox" -> null
    }

  # azurerm_role_assignment.roles["00-ingest00-network-sbox-User-prasanna.krishnan@justice.gov.uk"] will be destroyed
  # (because key ["00-ingest00-network-sbox-User-prasanna.krishnan@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Authorization/roleAssignments/3fc9f402-67fa-1402-f33f-5cf463a4da08" -> null
      - name                 = "3fc9f402-67fa-1402-f33f-5cf463a4da08" -> null
      - principal_id         = "c064d48d-defc-4a2f-afba-5c8571d44de4" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name = "Owner" -> null
      - scope                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox" -> null
    }

  # azurerm_role_assignment.roles["00-ingest00-runtimes-sbox-User-dominic.leary@justice.gov.uk"] will be destroyed
  # (because key ["00-ingest00-runtimes-sbox-User-dominic.leary@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-runtimes-sbox/providers/Microsoft.Authorization/roleAssignments/1ba4a5a1-5b67-a28f-a94a-3e6ae733a567" -> null
      - name                 = "1ba4a5a1-5b67-a28f-a94a-3e6ae733a567" -> null
      - principal_id         = "8c3e64ea-b92f-4e47-b6d9-7abbb1df48e3" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name = "Owner" -> null
      - scope                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-runtimes-sbox" -> null
    }

  # azurerm_role_assignment.roles["00-ingest00-runtimes-sbox-User-prasanna.krishnan@justice.gov.uk"] will be destroyed
  # (because key ["00-ingest00-runtimes-sbox-User-prasanna.krishnan@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-runtimes-sbox/providers/Microsoft.Authorization/roleAssignments/ef3f1108-930f-db51-63a4-7abc5e11fb71" -> null
      - name                 = "ef3f1108-930f-db51-63a4-7abc5e11fb71" -> null
      - principal_id         = "c064d48d-defc-4a2f-afba-5c8571d44de4" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name = "Owner" -> null
      - scope                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-runtimes-sbox" -> null
    }

  # azurerm_role_assignment.roles["00-ingest00-shared-integration-sbox-User-dominic.leary@justice.gov.uk"] will be destroyed
  # (because key ["00-ingest00-shared-integration-sbox-User-dominic.leary@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.Authorization/roleAssignments/cd140d17-cb68-3230-8924-6522029216b5" -> null
      - name                 = "cd140d17-cb68-3230-8924-6522029216b5" -> null
      - principal_id         = "8c3e64ea-b92f-4e47-b6d9-7abbb1df48e3" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name = "Owner" -> null
      - scope                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox" -> null
    }

  # azurerm_role_assignment.roles["00-ingest00-shared-integration-sbox-User-prasanna.krishnan@justice.gov.uk"] will be destroyed
  # (because key ["00-ingest00-shared-integration-sbox-User-prasanna.krishnan@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.Authorization/roleAssignments/2aa6089f-c0c8-0ada-06bb-a7999e3d2969" -> null
      - name                 = "2aa6089f-c0c8-0ada-06bb-a7999e3d2969" -> null
      - principal_id         = "c064d48d-defc-4a2f-afba-5c8571d44de4" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name = "Owner" -> null
      - scope                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox" -> null
    }

  # azurerm_role_assignment.roles["00-ingest00-shared-product-sbox-User-dominic.leary@justice.gov.uk"] will be destroyed
  # (because key ["00-ingest00-shared-product-sbox-User-dominic.leary@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Authorization/roleAssignments/f80773ee-d123-48c8-6a9c-f24887107db7" -> null
      - name                 = "f80773ee-d123-48c8-6a9c-f24887107db7" -> null
      - principal_id         = "8c3e64ea-b92f-4e47-b6d9-7abbb1df48e3" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name = "Owner" -> null
      - scope                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox" -> null
    }

  # azurerm_role_assignment.roles["00-ingest00-shared-product-sbox-User-prasanna.krishnan@justice.gov.uk"] will be destroyed
  # (because key ["00-ingest00-shared-product-sbox-User-prasanna.krishnan@justice.gov.uk"] is not in for_each map)
  - resource "azurerm_role_assignment" "roles" {
      - id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox/providers/Microsoft.Authorization/roleAssignments/37e11f49-3280-a6ec-842a-1f5f375e9733" -> null
      - name                 = "37e11f49-3280-a6ec-842a-1f5f375e9733" -> null
      - principal_id         = "c064d48d-defc-4a2f-afba-5c8571d44de4" -> null
      - principal_type       = "User" -> null
      - role_definition_id   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> null
      - role_definition_name = "Owner" -> null
      - scope                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-product-sbox" -> null
    }

  # azurerm_role_assignment.roles["00-ingest00-storage-sbox-User-dominic.leary@justice.gov.uk"] will be destroy

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ses_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.data_landing_zone["01"].module.metadata_mssql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["01"].module.metadata_mssql.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.metadata_mssql.azurerm_mssql_server.this will be updated in-place
  ~ resource "azurerm_mssql_server" "this" {
        id                                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Sql/servers/ingest01-metadata-mssql-sbox"
        name                                 = "ingest01-metadata-mssql-sbox"
        tags                                 = {
            "Data-Ingest-Project" = "ajb test temp"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (11 unchanged attributes hidden)

      ~ azuread_administrator {
          ~ object_id                   = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply)
          ~ tenant_id                   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["01"].module.metadata_mysql.data.azuread_group.admin_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "admin_group" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Platform Operations"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.data_landing_zone["01"].module.metadata_mysql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["01"].module.metadata_mysql.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.runtimes_datafactory.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["01"].module.runtimes_datafactory.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.shared_integration_databricks.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["01"].module.shared_integration_databricks.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.shared_integration_datafactory.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["01"].module.shared_integration_datafactory.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.storage["curated"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.storage["external"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.storage["raw"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.storage["workspace"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0] will be destroyed
  # (because module.data_landing_zone["00"].module.shir001.module.shir_vmss is not in configuration)
  - resource "azurerm_windows_virtual_machine_scale_set" "windows_scale_set" {
      - admin_password                                    = (sensitive value) -> null
      - admin_username                                    = "VMAdmin" -> null
      - computer_name_prefix                              = "shir001" -> null
      - do_not_run_extensions_on_overprovisioned_machines = false -> null
      - enable_automatic_updates                          = true -> null
      - encryption_at_host_enabled                        = false -> null
      - extension_operations_enabled                      = true -> null
      - extensions_time_budget                            = "PT1H30M" -> null
      - id                                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-runtimes-sbox/providers/Microsoft.Compute/virtualMachineScaleSets/ingest00-shir001-vmss-sbox" -> null
      - instances                                         = 1 -> null
      - location                                          = "uksouth" -> null
      - max_bid_price                                     = -1 -> null
      - name                                              = "ingest00-shir001-vmss-sbox" -> null
      - overprovision                                     = true -> null
      - platform_fault_domain_count                       = 5 -> null
      - priority                                          = "Regular" -> null
      - provision_vm_agent                                = true -> null
      - resource_group_name                               = "ingest00-runtimes-sbox" -> null
      - scale_in_policy                                   = "Default" -> null
      - secure_boot_enabled                               = false -> null
      - single_placement_group                            = true -> null
      - sku                                               = "Standard_D4ds_v5" -> null
      - tags                                              = {
          - "Data-Ingest-Project" = "example landing zone"
          - "application"         = "dlrm-data-ingest"
          - "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          - "businessArea"        = "cross-cutting"
          - "criticality"         = "Low"
          - "environment"         = "sandbox"
          - "expiresAfter"        = "3000-01-01"
          - "startupMode"         = "always"
        } -> null
      - unique_id                                         = "0c375985-d948-4063-bdf7-f3a4e8f85665" -> null
      - upgrade_mode                                      = "Automatic" -> null
      - vtpm_enabled                                      = false -> null
      - zone_balance                                      = false -> null
      - zones                                             = [
          - "1",
        ] -> null

      - automatic_instance_repair {
          - enabled      = false -> null
          - grace_period = "PT30M" -> null
        }

      - extension {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      - identity {
          - identity_ids = [] -> null
          - principal_id = "79e4db5d-7db4-4555-9c7a-c3ed94968174" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }

      - network_interface {
          - dns_servers                   = [] -> null
          - enable_accelerated_networking = false -> null
          - enable_ip_forwarding          = false -> null
          - name                          = "ingest00-shir001-nic" -> null
          - primary                       = true -> null

          - ip_configuration {
              - application_gateway_backend_address_pool_ids = [] -> null
              - application_security_group_ids               = [] -> null
              - load_balancer_backend_address_pool_ids       = [
                  - "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-runtimes-sbox/providers/Microsoft.Network/loadBalancers/ingest00-shir001-lb-sbox/backendAddressPools/ingest00-shir001",
                ] -> null
              - load_balancer_inbound_nat_rules_ids          = [
                  - "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-runtimes-sbox/providers/Microsoft.Network/loadBalancers/ingest00-shir001-lb-sbox/inboundNatPools/ingest00-shir001-natpool-sbox",
                ] -> null
              - name                                         = "ingest00-shir001-ipconfig" -> null
              - primary                                      = true -> null
              - subnet_id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox" -> null
              - version                                      = "IPv4" -> null
            }
        }

      - os_disk {
          - caching                   = "ReadWrite" -> null
          - disk_size_gb              = 127 -> null
          - storage_account_type      = "StandardSSD_LRS" -> null
          - write_accelerator_enabled = false -> null
        }

      - scale_in {
          - force_deletion_enabled = false -> null
          - rule                   = "Default" -> null
        }

      - source_image_reference {
          - offer     = "WindowsServer" -> null
          - publisher = "MicrosoftWindowsServer" -> null
          - sku       = "2022-datacenter-azure-edition" -> null
          - version   = "latest" -> null
        }
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.random_string.password will be destroyed
  # (because module.data_landing_zone["00"].module.shir001.module.shir_vmss is not in configuration)
  - resource "random_string" "password" {
      - id          = "HV48" -> null
      - length      = 4 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "HV48" -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.data_landing_zone["01"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

Plan: 1 to add, 1 to change, 234 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":27,"Program":"tfcmt","SHA1":"","Target":"sbox_landing","Vars":{}} -->